{"review_id": "-I5umRTkhw15RqpKMl_o1Q", "user_id": "-mA3-1mN4JIEkqOtdbNXCQ", "business_id": "mRUVMJkUGxrByzMQ2MuOpA", "stars": 1.0, "text": "Walked in around 4 on a Friday afternoon, we sat at a table just off the bar and walked out after 5 min or so. Don't even think they realized we walked in. However everyone at the bar noticed we walked in!!! Service was non existent at best. Not a good way for a new business to start out. Oh well, the location they are at has been about 5 different things over the past several years, so they will just be added to the list. SMDH!!!", "date": "2017-12-15 23:27:08"}
{"review_id": "qlXw1JQ0UodW7qrmVgwCXw", "user_id": "bAhqAPoWaZYcyYi7bs024Q", "business_id": "LUN6swQYa4xJKaM_UEUOEw", "stars": 4.0, "text": "Michael from Red Carpet VIP is amazing ! I reached out because I needed help planning my soon to be sister in law's bachelorette. It was a group of 10 girls so I was a little overwhelmed but Michael saved the day! Everything was super smooth and easy! We got good deals and had the best time ever! We booked hotel and a bachelorette package for a great price. I have saved contact info because I will for sure reach out again on next Vegas trip!!!", "date": "2018-04-27 20:25:26"}
{"review_id": "1wVA2-vQIuW_ClmXkDxqMQ", "user_id": "86J5DwcFk4f4In1Vxe2TvA", "business_id": "NyLYY8q1-H3hfsTwuwLPCg", "stars": 4.0, "text": "Great lunch today. Staff was very helpful in assisting with selections and knowledgeable on the ingredients. We enjoyed the BBQ chicken with tika masala sauce and really good naan bread. The biryani with chicken was also yummy! Fun to see the food being prepared in the tandoori ovens. Great addition to the fast casual scene in Cleveland.", "date": "2015-01-03 22:47:34"}
{"review_id": "rEITo90tpyKmEfNDp3Ou3A", "user_id": "6Fz_nus_OG4gar721OKgZA", "business_id": "6lj2BJ4tJeu7db5asGHQ4w", "stars": 5.0, "text": "We've been a huge Slim's fan since they opened one up in Texas about two years ago when we used to live there. This place never disappoints. They even have great salads and grilled chicken. Plus they have fresh brewed sweet tea, it's the best!", "date": "2017-05-26 01:23:19"}
{"review_id": "IPw8yWiyqnfBzzWmypUHgg", "user_id": "5JVY32_bmTBfIGpCCsnAfw", "business_id": "Mem13A3C202RzT53npn4NA", "stars": 5.0, "text": "If you are looking for the best pierogies in Pittsburgh, this is your place. There are a few small tables outside but most of the business is carry out. Pierogies Plus wins Best Pierogies every year. Why? Because the owner is from Poland and she is making the real deal pierogies. The best part is that they are hand pinched by a group of older Polish and Hungarian women. \nThe biggest seller is potato and cheese but they sell many flavors. They are like plump pillows of softness. You can buy them buy the dozen. You can get them cold to take home and freeze or warm and ready to eat. The warm ones are served with butter and onions.  It's definitely a comfort food. The best part is that they ship internationally. Yes, they are that good.", "date": "2017-05-13 10:41:43"}
{"review_id": "IByf6mVY0WA838XNSh-5MA", "user_id": "3CJUJILq7CLHk_9OrvpvQg", "business_id": "I4Nr-MVc26qWr08-S3Q1ow", "stars": 4.0, "text": "The food is always good and the prices are reasonable.  Although it's not exactly a restaurant -- more like a snack bar, limited menu and you walk up to the counter, place your order, wait a minute or so for them to prepare your order, and pay the cashier, then search for a table.  Kind of like a sandwich shop.  Still a much better choice for value than the other hotel Deli's on the strip.", "date": "2016-01-17 05:26:22"}
{"review_id": "E6B-2U2sGG3xgmnNWZAEew", "user_id": "DbccYu3OppWKl21OanZnTg", "business_id": "YSUcHqlKMPHHJ_cTrqtNrA", "stars": 1.0, "text": "Came here on a Thursday night at 6:30 p.m. My friends and I had a reservation, but it was not needed - the place was almost empty.\n\nSERVICE: Extremely Poor\n\nWhile I enjoyed the company of my friends, I would not come back to this restaurant, primarily because of the poor service. Once we were all seated, we were not greeted by anyone for over half an hour, and when someone did come by, we asked whether we could place our orders, to which he said he could not; he's doing something else - so we waited at least another 15 minutes before someone came to finally take our orders. \n\nMAIN: Caprese Salad\n\nThe salad was okay - a bit salty for my liking. I personally did not find this dish filling, so I ordered the sweet potato fries as well (See below).\n\nMAIN: Sweet Potato Fries (this was worth it) \n\nThese fries were actually very delicious - crispy on the outside and soft on the inside. If you visit this restaurant, I would recommend this particular dish, especially given the price ($8) and the portion size (it was quite large - almost the size of a large plate).", "date": "2017-12-29 13:55:19"}
{"review_id": "NqYSX93Amv4sd5pPPr3Gag", "user_id": "zFYFuufYWQSPj0r5lrKQKg", "business_id": "wJj1EwYcXHdvA9zKqmb5hQ", "stars": 5.0, "text": "I called the number provided and same day they showed up to my residence for an inspection. Was able to advise me of multiple broken and loose tiles on my roof and came out just a few days later and completed the repairs. Quoted me a good price for the repairs as well. No complaints!", "date": "2018-10-04 11:20:42"}
{"review_id": "vzMkIQm34QWBCYaHdV-2mQ", "user_id": "jAVtSgE5L-Dt6_I5FIiVGA", "business_id": "EIL41z-hvVCeYHqfA9PyWQ", "stars": 5.0, "text": "Flat out fantastic!  Have been here twice and the croissants are the bomb. Can't wait until I can try other items. THE new breakfast spot in Ahwahtukee. The service is great as well. Family run business. Come and support them.", "date": "2017-09-20 15:23:35"}
{"review_id": "Saae_VVf_v0fyNmB6Dc4kw", "user_id": "PttoI2Meg76KVB8JxjC5Xw", "business_id": "rBo_suDMdGmFQ0TtYg3b2Q", "stars": 1.0, "text": "I've never experienced discrimination as I did last night at this place. I was with 2 other females...we had on dresses and heels. The place was very diverse as far as how everyone was dressed. Dresses, heels, jeans, flip flops, shorts, etc. Immediately we noticed large groups of people of a particular race coming from the back of the line and going inside. We thought nothing of it...assumed they were all on lists. Then it just got weird. We noticed the guy working the door was walking back and fourth scanning the line for people he would pull out and let go inside. Every time it just happened to be groups with Caucasian people. 4 Caucasian girls were in front of us and behind a group of 4 black males. The girls were pulled out of the line and taken to the door to go inside, no talk of any lists. The guys were told they must be on a list or leave. The guys left. We watched this happen quite a few more times before we just gave up here and removed ourselves from the line. We were standing in the front for a really long time with no acknowledgement from the guy working the door. Funny thing is he didn't make a big announcement that we must be on a list to get inside. He was walking up to particular groups and telling them in a low tone so they would leave. I know it wasn't because of how we were dressed or looked....they were letting people in with jeans and flip flops. Ultimately we were let in by a bouncer at a side door. There was nothing so special going on in there that they had to be \"picky\" about who they let inside. It was like a night at Suite.  Safe to say, I will never step foot in this place again.", "date": "2014-07-13 16:17:18"}
{"review_id": "if6UbmA8Z254rlIiKvYiAg", "user_id": "3owWXgw7_Czt5o35dVYOkg", "business_id": "PZMpjUQ9_JVCf4Htu6vZYg", "stars": 1.0, "text": "((( LADIES BEWARE))) Don't ever take your machine to 35th Ave. sew and vac on Northern they broke my Elna machine while it was being repaired. I've spent over $10.000 at their store over the years and have been a long time customer .. Bill the owners son was so rude to me and did nothing to resolve my broken machine. I was disgusted when Bill the owners daughter wouldn't do Any thing to help me when the repair man broke my machine. It's terrible to bring a nice sewing machine in to be repaired and these people broke it while in their possession and they don't want to do a damm thing about it. It was like a big (screw you) to me. I won't buy another thing from these people for the way I was treated. Even the material is too over priced. I'm in the market for another machine but I won't go there ever again. My machine STILL NEEDS TO BE TAKEN CARE OF AND THEY STILL HAVE NOT RESOLVED THIS ISSUE. ITS STILL BROKEN AND IT HAPPENED WHILE REPAIRMAN WAS SERVICING MY MACHINE. I WISH I HAD NEVER TAKEN MY MACHINE TO 35TH AVE SEW AND VAC SHOP. WHY CANT PEOPLE OWN UP TO TAKE OWNERSHIP TO THEIR RESPONSIBILITY FOR THEIR OWN MISTAKES!!!! GO TO KINGS SEWING MACHINES MUCH BETTER SERVICE AND THEY DONT BREAK YOUR MACHINE!!!!!", "date": "2017-01-27 19:15:36"}
{"review_id": "dcKpWjwqKl0ImVKEru6Q1A", "user_id": "X-5IICsYwqImns4WxHi91Q", "business_id": "CZKkoMlqu0N0zCFK-3T_Fg", "stars": 4.0, "text": "Great cocktails and very good food.  Overall first class restaurant.", "date": "2013-02-21 21:25:07"}
{"review_id": "36xxeOr4m4UlRf9FM1HzdA", "user_id": "liUNZm0tOJJ-d-pFCdqu9A", "business_id": "ZNB91myFoOYgyXoG5LQeGQ", "stars": 1.0, "text": "I took my wife out for a Birthday dinner with my daughter on 12-16-14  at Alfonsos.  I heard the food was good and it was and my waitress ( Dawn ) was also good ( even with it being very busy ). The problem I have is some of the waitress staff are rude. I had a gift card/ certificate to pay for dinner. After a few minutes, a big blond waitress came over and said  ( in a loud and rude tone ) I couldn't use it cause I needed to spend $100.00 in order to get $50.00 off. She then insulted me by saying (so the tables around me could hear ) couldn't I read the fine print telling me of requirements to use gift card. I showed her the certificate and the fine print was not legible She told me, sorry that's not our fault it's yours and she walked away. I am having second thoughts about going back to use gift card. I may give it away or toss it out.", "date": "2014-12-17 19:34:47"}
{"review_id": "4aX4qoetCm45i4Phut_sww", "user_id": "gt9w3MAaBemQsUCS_xapMw", "business_id": "KjicU7uxRt2KDEnO5cgxDQ", "stars": 1.0, "text": "This company tried deliver flowers to our home- my son was home by himself and called me.  I had him keep me on the phone while he opened the front door (our security screen door was  locked though).  He told the gal that he was not going to open the door, that his mom (me) was on the phone and he asked the driver to call me, his mom.  The driver was very insistent about getting a signature and became argumentative.  My son kept saying, call my mom, she's on the phone now.  And she kept interrupting and insistent on a signature.  I told my son to close the door.  I then called the company and spoke with a Manager, Sara.  She understood my concern and said she would make sure the driver was trained on these situations.  Three days pass and I still don't have my flowers or a phone call.  I called and spoke with Sara and she had a completely different tone with me than previously.  She was very curt and tried to give me lots of excuses. I asked that the Owners call me.  Five days later, I've never received a call back from the Owner or my flowers.  I called to find out when one of the Owners would call back, and Linda told me it would be by Friday, which meant six days later than my initial request.  I told Linda that was pretty unreasonable and she told me that the Owners are busy and have several other businesses.  In my opinion, that's completely unacceptable- do yourself a favor and do not order from this Company.  They are very unprofessional and not very concerned about customer service.", "date": "2017-06-27 23:17:40"}
{"review_id": "QSe9EqmiImbguDVIraX_rg", "user_id": "II8eB5mYk200GW-m-wpsug", "business_id": "z9aXGRH8xtqpNDFE5_I3KA", "stars": 4.0, "text": "received a  mailer and thought okay let's go. walked in on a Monday afternoon greeted by a bartender wearing a cute  t shirt that said the bar and below that the baby. how cute however never got her name. looked over menu asked what was good she said the club. so ordered it and  yes it is good. had a beer a club on white toast served with fries and watched sport center. really felt at ease there and good music playing. will go back again.", "date": "2015-06-21 00:56:28"}
{"review_id": "9X9G_UAQN5W3mmspIjsLXA", "user_id": "hTZb1INhnCG8URaFywVoYQ", "business_id": "nDaW2hhQV5KYiGH7HzAOcg", "stars": 3.0, "text": "I stumbled upon this ice cream store and seeing the high reviews on Yelp, went in with high expectations. First off, the prices are fairly high considering the size of the cones and cups they use. It's almost $4 for a small scoop, which is pretty overpriced in my opinion. Their flavours are a little more creative than most traditional ice cream stores and it is marginally creamier. The Noah I had was pretty neat with some different ingredients mixed into it as well. But, not worth that price and on some hot summer days, that lineup.\n\nAlso note that it is a tiny store that fits no more than a dozen people, so don't expect to sit inside enjoying your ice cream there.", "date": "2016-12-04 02:34:48"}
{"review_id": "dS5ERxmIP-CQ_ZV_q_xc0A", "user_id": "SYRRQJoa5gQ8Duev4uSWag", "business_id": "8KmqWgL0UEdxJFwTZ_YZvQ", "stars": 5.0, "text": "These burgers are phenomenal! The Galley Boy just melts in your mouth, and paired with the potato teasers and a milkshake it is like heaven on Earth.", "date": "2012-12-04 03:30:31"}
{"review_id": "m2H0m3pDUNmkXZP4K8c_oA", "user_id": "fVK8D0rE9ez1fsQNW_bzRA", "business_id": "5qG4UHurI1yEozwn25WAFw", "stars": 2.0, "text": "#1 it should be advertised as a vegetarian dinner. For the price we paid, I really would have liked a nice cut of meat. \n#2. Way over priced. Dinner for 2 with (2) blue moon beers and (1) $10 glass of wine... $165+tip. We tipped over 25% because our server was great and the experience of eating in the Dark was a pretty interesting experience. \n#3. The food was Meh... I would have been okay with everything else if the food was outstanding. It really wasn't... I probably ate 3 bites of my dinner entree just to taste what the different Ingredients were... It was far from savory and could have used even a pasta or something. A couple of dry (what tasted like hush puppies)?? I would have been impressed a little if when I told the server that I didn't enjoy it if he would have offered to try one of the others, but I didn't make a big deal because like I said before he was really nice. The dessert was literally the only saving grace. \nAll in all I gave a 2 star... (server and experience in the dark)... I just have to be honest incase others go in expecting a non-vegetarian meal... Be ready for a $200 vegetarian dinner!!!!\n*** also if they don't like your review on their Facebook page they will block you from commenting on other people talking crap about you, they can not handle the truth and allow others to put you down ***", "date": "2017-12-02 18:35:23"}
{"review_id": "VukV341GHtm9kcvoKR-5vQ", "user_id": "3Ft0HhzBP-iknnHt-PFX8g", "business_id": "jg72eKbD8rlv0i1DRN5uxQ", "stars": 1.0, "text": "Came here for the \"midnight\" launch of the PSVR. After previously being told by another employee a week prior to get there at 6:01PM to get one of the six extra systems that weren't pre-ordered, and that it was first come first serve, I ended up not able to get a system. When I came in yesterday, the woman behind the counter told me they had written down names and numbers of people who wanted one a few days prior, and that they all were accounted for. \n\nThe previous employee even told me I was the first person to have asked about it. If they were organized, and told ALL their employees customers could put their names down on a PSVR, I could have gotten a system last night.\n\nNot only did this illiminate my chances of getting a system at GameStop, but made it too late for me to go to other department stores who had stock (as they were too far away, and lines were already forming at each location). \n\nNot happy.", "date": "2016-10-13 20:59:22"}
{"review_id": "W6VRRz7mVGZLsidyHelHwg", "user_id": "To4ATBBNlnC5gzj0dwXfuA", "business_id": "EgwGTDZ705TwudPJwAY0yQ", "stars": 5.0, "text": "This place is quite possibly my favorite restaurant in Phoenix. \n\nMy favorites are the Chicken Scarpariello, the pizza and the Sangria. My wife can't decide between four dishes. Our daughter loves the Penne ala Vodka, Lasagna, or Ravioli.\n\nMario and his sons work hard to please and we've never had a bad meal here. I've seen them bend over backwards to try and take care of obvious jerks. \n\nPlus to top it off, when local school invited local pizza places to present to a class on making pizza and recycling issues, Mario came and talked to the kids as if they were adults. All the other places treated it as a marketing event and brought coupons. \n\nGet the idea? It's all good at this neighborhood gem!", "date": "2011-01-09 00:07:16"}
{"review_id": "m7eosmcK66RU_61UHbNMww", "user_id": "0v0aVNJEixurV1Ib0iqzJg", "business_id": "PFmB_iraAbTN9XMka7soqQ", "stars": 5.0, "text": "Today was my first time seeing the staff at Bella Smile and it was a great experience.  Although I'm not currently living in Las Vegas I plan on coming back for checkups and any other problems that may arise.  There was no wait time whatsoever and I was out of there without a drop of pain or discomfort.  The manager Severn was very accommodating and will be getting business from my family and friends in town.", "date": "2017-06-27 22:49:09"}
{"review_id": "ngN7BwOpWUPA5yhmjNew7g", "user_id": "aXhMt_8ZDmfpr2QZ3zlmog", "business_id": "sT6KKMATRTiNSJ896D7l2w", "stars": 4.0, "text": "Love the crust on this pizza. The sauce is decent, cheese is okay, the pepperoni was not the best quality. \nMy friend ordered an everything slice, said it was good, just wished so cheese was on the toppings to hold it together.", "date": "2014-09-09 18:54:45"}
{"review_id": "l7KB334CXThAcmZPOvF1zw", "user_id": "N6zhXHPIrCXommDEg0Rw3g", "business_id": "Gyrez6K8f1AyR7dzW9fvAw", "stars": 2.0, "text": "Normally, I give a restaurant at least 3 stars as long as it has good food. However, our group was quite disappointed with this restaurant. Granted, we were expecting a lot from an Italian restaurant in the Venetian, but I also think those are fine expectations to have when eating at these prices.\n\nFirst, we changed our reservation, and they said they could accommodate the time. Clearly, they shouldn't have. We were seated at a folding table in the hallway next to the restaurant, quite literally in the food court next to a kiosk selling trinkets to tourists. Whatever ambiance this restaurant might offer is a mystery to me. They shouldn't have switched the reservation if it wasn't possible to accommodate the change (our fault, wouldn't blame them). I know they threw a table together as our table and chairs looked different from the rest of the ones set up. A few were just in front of the restaurant but not off to the side like ours was.\n\nI expected to pay a lot in the Venetian, but I expected to be blown away. I would have preferred dining at several places we walked at on the way to this one. I paid $17 for spaghetti carbonara. It was very tasty, a well-balanced sauce with a decent amount of pancetta. However, I finished the whole thing. I can't finish an entree at Olive Garden for the same price. I also ate a few pieces of bread. One of my friends ordered a chicken kabob (who knows why that's sold at an Italian restaurant). It was one single kabob with perhaps 4-5 pieces of chicken and 4-5 vegetables on a bed of rice and it cost $25! Absolutely outrageous. \n\nTo top it off, we told the waiter we were celebrating a birthday. He said ok, so I expected we would receive a dessert, as is customary. We received nothing. Of course, our waiter didn't seem keen on giving us the time of day so I don't know why I expected him to remember a birthday.", "date": "2017-01-02 03:48:03"}
{"review_id": "V2alPCkzmHqTF8u2JKPiOA", "user_id": "ag5GlfKKtjcnNw2VgVxNRg", "business_id": "1A1b0ELki8v-C-0VtdoGAg", "stars": 4.0, "text": "They came out when they said they would, did the job in the amount of time they said it would take for the amount they said it would cost. They sold me exactly what I needed to hopefully keep my basement from flooding and didn't try to sell me a bunch of things I didn't need, subsequently their quote was 1/3 of those other waterproofing guys and I'm willing to bet my basement will stay dry just as long! Thanks to Nick's crew!\nThe O'Donnells", "date": "2013-09-04 01:21:35"}
{"review_id": "5K0whjm5M3QCRLFkgb7ecw", "user_id": "9q0f4vm589zztMgR4INpZg", "business_id": "9nTF596jDvBBia2EXXiOOg", "stars": 5.0, "text": "I really enjoyed coming here, it located near walnut st which meant parking was difficult. \n\nWhat I didn't realized was that hot pots where individualized. They gave a pot over an electric hot plate which you can adjust the temp. They also have hot water on the side in case you run out. Very fulfilling for $15.\n\nIt's a small area and they also have a section for you to customize your own sauces.", "date": "2014-01-17 02:02:59"}
{"review_id": "a6N51Ov3NEchmqsquNGtMA", "user_id": "qpYllTutvfoKvT5OEl7gGQ", "business_id": "HkbNItNrnXlNo59M0YyoMg", "stars": 5.0, "text": "I've been coming to Loco on mill since they opened. I love coming here especially on Sundays for football. They have all the games on, great bloodys, and awesome breakfast!  Loco is my local watering hole and I always have a great time with the staff.", "date": "2016-09-30 19:51:43"}
{"review_id": "sdMeynFmJknSQq1zUV2fUQ", "user_id": "Ouu5ycmS2EOtqPbk6JZvTw", "business_id": "4RA3hdiiC3vuiaSIraZ28g", "stars": 4.0, "text": "Ordered combo 3.  It comes with two plates or rice (or bread), one skewer of chicken breast kebob, one skewer of koobideh, one skewer of barg kebob, 3 grilled tomatoes, a plate of parsley and sliced radish, a bunch of basil.  No salad.\n\nThe meat were all very flavourful, not dry and juicy!!! The taste was very good.   Definitely a lot of food for two people. :)\n\nThe waitress was very friendly and attentive.  \n\nI read another review that they do not accept amex, and yeah they really don't.  But I asked before I paid for the meal so it's ok.", "date": "2017-09-20 14:53:23"}
{"review_id": "_LPOtmfWnL_8_tL3ImhoLw", "user_id": "91DAiIKXri-41uzYue2hlg", "business_id": "w6F502EKMyn3ONbGT2bQxw", "stars": 5.0, "text": "Not sure why some posted negative reviews of this place because it is on point. My girlfriend and I had dinner there last night, with reservations set for 6 p.m., were seated by 6:05. Our server William was awesome, was fast, attentative and really was one of the best servers we've encountered and we dine out a lot. We both ordered all you can eat crab legs and they were fresh, hot and delicious. I do feel the sticker price was high but we must have had 5 buckets each so it equates to 10 bucks a pound. \n\nThe only negative I did feel could be addressed is the tables are made of some type of epoxy resin so being outside, May be melting or something because there was a sticky residue on the table top. I just played a napkin over it so it was acceptable. \n\nMy girlfriend and I will definitely be returning to pickle bills, we had a fantastic evening. Last thing to note, the service was great even though the place was packed!", "date": "2015-08-30 13:17:23"}
{"review_id": "_lGsXGF_nnKzmwl0I_A9tA", "user_id": "iJCtRAlSvxiUuKlVAnsq0A", "business_id": "q8MUVVuQpfR6v0HBHmAFxw", "stars": 4.0, "text": "They specialize in Southern California-style food like burritos, salsas and fish tacos. The decor and ambiance is great. The tables and bar stools, exposed-brick wall, modern light fixtures etc. make for a classy and comfortable dining experience. I saw a few craft beers and a respectable bourbon list. However, we did an early Saturday morning breakfast, which was fantastic. The banana pancakes were unreal.", "date": "2013-12-28 23:36:44"}
{"review_id": "_MQLmkkPKBo5ibPaidZZCQ", "user_id": "8pv8leqC1AVx1KgefjM8sw", "business_id": "MPLhOV-JbmntkbcXMyCODg", "stars": 2.0, "text": "The only reason I'm even giving this place 2 stars is because of their food and drinks. Their service however, is probably the WORST I've ever had. I used to (emphasis on the tense) go there every Tuesday for trivia night (the guy hosting is awesome). My service has been absolutely horrible every time except for once when a girl named Jess waited on us. The rest of the waitresses are completely incompetent and utterly rude off the bat. \n\nWhen we began ordering appetizers the waitress stopped us and asked if this was \"going to be complicated or not.\" She then forgot to put in an order for 1 of 3 appetizers ordered. It took about 15 mins after getting 2 of them, to even bring that to her attention, for which she didn't even apologize. After 35mins and someone else bringing our food out, we finally had to go to the bar and ask someone to come take our drink orders, a task that was also messed up (I ordered their special of Big ass margeritas to which I received a small mason jar of mostly ice). They told me it'd be free, but it honestly wasn't even worth that. After that, the only time I saw our waitress was when she was visibly talking about us and pointing with another waitress. Completely unprofessional. A different waitress had to bring us our checks and messed that up too. \n\nI had this same waitress the Tuesday before accompanied by the same crummy service. That's when I realized that it wasn't just a bad or busy night (it was a Tuesday for crying out loud), but that this woman is just REALLY bad at customer service. Definitely do NOT recommend going there!!! Don't know exactly which was our original waitress but our checks said Joanne G. \n\nWill also be posting my experience on your Facebook in hopes that you get better trained and caring staff.", "date": "2017-08-16 04:18:04"}
{"review_id": "ewmaCrLXQW7mg1Z4gAtgZg", "user_id": "zCnJQKvZgET4llBbJD1aiw", "business_id": "OJ6zfenoK-eBNI7vvNrOsg", "stars": 3.0, "text": "You take the good, you take the bad, you take them both and there you have the facts of life... at Fieramosca.  (You are old like me if you know that theme song!)\n\nHave you ever gone to a restaurant with great expectations based on reviews and left disappointed?  That was our experience.\n\nSome call it cozy but for me the table layout in the main dining room is claustrophobically cramped.  If you want a seat on the patio on Friday or Saturday in the summer, make sure to reserve several days in advance.\n\nReservations are taken by phone and I will admit they were very helpful even if it did take 10 rings for them to answer... I was surprised that a restaurant in this price range did not have online reservations!\n\nBeing in a house transformed into a restaurant, the entry hallway is narrow, so if someone is going out, nobody can go in and vice versa.  \n\nSo if you are even a little claustrophobic,  be warned, you won't be comfortable here.  \n\nThe food:\n\nComplimentary bruschetta:  A plain Pizza crust with bruschetta topping which falls off and wasn't that flavourful. Go to La Bruschetta to find out how it is meant to taste.\n\nCaesar salad:  Crispy romaine, hints of fresh garlic and Parmesan but the dressing seemed watery and the croutons were like rocks.\n\nBread basket:  Now I know why the croutons are like rocks, the crust on the bread was so hard I was worried I would break a tooth, and I also found it strange to be served whole wheat bread, when I was expecting crusty Italian bread.  \n\nSpaghetti Carbonara:   The reason we came was because Hubby was craving Carbonara and based on great reviews we thought we would try it here but he found Fieramosca's version disappointingly bland, even with extra Parmesan cheese and fresh ground pepper.  \n\nLinguini DI Mamma Ninetta:  I love mushrooms but was surprised that there were so many in this dish... With just 3 small shrimp and a few small pieces of chicken scattered throughout, and very little garlic flavour, this dish was edible but far from great.\n\nTiramisu:  No coffee flavour!  I have made Tiramisu before and have had it in countless restaurants and I know the lady fingers are to be dipped in coffee before being covered in cream, and these missed the coffee altogether, and the cream here seemed to just be whipped cream, none of the yummy marscapone that I was expecting.   Libretto's Tiramisu in a jar might not be traditional in presentation but has all the flavour that Fieramosca's lacked.  My favourite dessert when done well, I left disappointed.\n\nLemon Sorbet:  Frozen sorbet in a scooped out lemon, menu says imported from Italy.  I actually liked it better than the sad face Tiramisu so hubby swapped with me because while he usually loves anything lemon, he found an odd aftertaste.  I joked it was the jet fumes to bring frozen sorbet from Italy but the truth is, it was the perfume worn by the woman at the table next to ours.  Thankfully she arrived as we had dessert, so our entire meal was not ruined, but the smell was so overpowering that it gave us both a headache and we wanted to get out of there fast, since with the cramped layout she was almost on top of our table.\n\nLadies, please don't drown yourself in perfume and go to a restaurant!  Ugh!\n\nTL;DR - Meh. Bottom line nothing was horrible but nothing was great, which for the price was disappointing.  Not worth a second visit.\n\n2 stars bumped to 3 because the service was good.\n\nThe search for Pasta Carbonara continues... maybe a trip to NYC or even Rome!", "date": "2016-07-03 17:00:03"}
{"review_id": "LQ4seKEnmMK5PYKtFcaT3A", "user_id": "9SqPSd2HnDJIM3v4_j9LYA", "business_id": "SVGApDPNdpFlEjwRQThCxA", "stars": 5.0, "text": "I don't normally say things are the best but these are the best fajitas I've ever had. Chips are perfect ,salsa is perfect, bean dip is perfect, and the best fried ice cream I've ever had. Plus the service is great.", "date": "2014-10-11 08:23:56"}
{"review_id": "gQl8mh2FlksNO3_An2IRxQ", "user_id": "gEIrEf488lkHwCoVOYd3vA", "business_id": "8WBHKj2davW6hhZWlUQ7DA", "stars": 5.0, "text": "Great venue. Every seat in the house is awesome. Been here twice, once for Britney and another time for Jlo. Both were fantastic performances; sexy, sultry, and high energy! Love, love them and this venue!", "date": "2016-02-11 23:45:29"}
{"review_id": "CI-XcT2XrBpC2RHmeVGaxg", "user_id": "Mrudkq5duCOoiuhL61ZBcQ", "business_id": "FKQUxOfW_W5R4OTut4G1Vw", "stars": 4.0, "text": "Definitely a spot to check out when looking for a quality sandwich at a reasonable price.\n\nThe shop staff are very friendly and more than willing to accommodate any request. \n\nDo yourself a favor and get one of the steak sandwiches off of the menu. They are amazing. The ultra is my favorite.\n\nAlso the Cancun fries are awesome. 1 order is for sue big enough to serve 2 people maybe even 3! \n\nThis is one of the Peppis that takes credit cards as well. Not all do FYI", "date": "2017-01-14 21:30:10"}
{"review_id": "VaNUI2jmyGABdjXcRwlSOA", "user_id": "Ux0QheGWOT5bchLngmdFuQ", "business_id": "eS76100l3h7Ollb5s3_M4A", "stars": 4.0, "text": "What a cute place! I was visiting relatives in the area and we went here to grab coffee and breakfast. The egg sandwich I got on a bagel was HUGE and tasty, but it was pretty greasy. The coffee is really good and the service is fast and friendly. I recommend it!", "date": "2016-01-04 03:37:35"}
{"review_id": "RThSyUZ1myb0-Nmjr8BFIw", "user_id": "RnkKHzIl3LVee_Q6zooQMQ", "business_id": "O-fYUqXjkwNvRfFnlUH6Iw", "stars": 2.0, "text": "Wonderful cookies, but don't order delivery. Took almost 2 hours to deliver less than a mile.... and no refund.", "date": "2018-09-25 03:21:19"}
{"review_id": "qa0QwP9mvcN9Pml6a-5K1g", "user_id": "dtanlcid8_m1L49ZK1YPfw", "business_id": "7rpa12_EX3A-hyGtrv8o3A", "stars": 4.0, "text": "Great food in a homely Mexican setting. The tomato soup was amazingly delicious and their chicken dishes are great. Close to the intersection of College & Yonge, this is one of the few non-fast food Mexican restaurants in the Village area.  If you're searching for a non-commercial dining experience with homemade dishes, this is the place to come.", "date": "2011-10-27 13:17:18"}
{"review_id": "A4G1-LTupScgaPmXF1OPMg", "user_id": "W2WICriV5Zf03S4ETzEsiQ", "business_id": "ujHiaprwCQ5ewziu0Vi9rw", "stars": 4.0, "text": "Around $45 for a dinner on a Friday night.\nSnow and Kind crab, caviar, steak tartare, all types of meat and cuts, sushi, soups, Asian cuisine, pastas and pizzas. Literally all you can think about.\nAlmost everything we tried was really good. \nTheir dessert section and flavors are one of the best !\n\nRecommended for sure", "date": "2015-12-05 03:28:19"}
{"review_id": "C0onMemq7n2bMx3fMQXF9w", "user_id": "1RQaXb0xSLsUzwJ0u4uZ-w", "business_id": "gOOfBSBZlffCkQ7dr7cpdw", "stars": 4.0, "text": "Went in on a Friday since I was strolling around the Venetian and came across this place! The wait wasn't too bad around 1pm (probably 25 minutes max). This place serves a variety of Latin American cuisines including tapas, tacos and burgers! It's standard pricing for Vegas. I ordered the brisket tacos and I didn't feel that they tasted anything out of the ordinary. Service was okay, but I thought it was really awesome for the server to ask my party right away if we have any allergies or items that we don't enjoy eating. However, the portions are on the smaller side so it's perfect to have lunch there if you don't want lug any leftovers around!", "date": "2018-04-27 18:53:06"}
{"review_id": "EaXwNVOmpCXwCchMR5TWlQ", "user_id": "vRSetBkuRMrjZvpW76gXFA", "business_id": "Wxxvi3LZbHNIDwJ-ZimtnA", "stars": 3.0, "text": "Paid for a view of the strip...Very disappointed.   Viewed the pool, saw through TI facade, Trump tower.  Not worth the extra price.  Restaurant choices were great, food was good, casino was fun.  Rooms are okay.  Would think twice before staying again.  Customer was excellant.  The staff is out\nstanding.", "date": "2016-07-14 18:58:35"}
{"review_id": "3Qc49B7dA0ONmCxrn5iwCQ", "user_id": "2k8OVAPxlXHsA5X6EIoQpQ", "business_id": "FhIeCF6QrsLaRvAeu0oEPQ", "stars": 2.0, "text": "OVERALL: The food isn't good (I explain below), but this place may still be worth locals' time (and more importantly money).  Let me explain...\n\nThere are not many \"old\" restaurants in this town. We don't seem to value/frequent/patronize places that have been around putting out food for a long time. I think we should. Even when the food isn't show stopping. Why? This place has tremendous character and charm. There's an \"Old Western Vegas\" feel to Bob Taylor's. Established in 1955, it's the oldest restaurant in Las Vegas. Its a throwback to a rugged, carnivorous cowboy culture that has existed in this town for decades. And still exists. I did appreciate the slice of Vegas kitch that Bob Taylor's offers. \n\nFOOD ISSUES: So with all that charm how could this place go wrong? This place could be great. It really should be great. But they are not putting enough care into the food. I ordered the rib eye and asked for it to be medium rare. I was worried about it being overcooked and figured if a mistake was made, I'd be in the medium range. My instincts were correct. But the steak was closer to well done. In total, three steaks at our table were seriously overcooked. In a steakhouse. With a man tasked with grilling the steaks. Sigh. The fourth steak, smoked prime rib, was cooked properly. But the prime rib is cooked ahead if time, right? How was I prepared for this overcooked piece of meat? How did this only occasional red-meat-eater suspect that my steak would not be treated with attentive care? \n\nI'll tell you. When we walked in there was a large grill at the front of the restaurant with a number if steaks cooking on it. But the chef was not watching the meat. He wasn't even in front of the grill. He was nowhere to be seen as we walked through the doors. And there were at least 4 steaks cooking when we arrived. So I figured that my steak would receive the same lack of attention.  \n\nI ordered a simple naked potato and a side salad to accompany my steak. Both were fine. But there is not much room to mess up a potato and iceberg, is there? People rave about the garlic bread and I think it's because the rest of the meal is so mediocre, that the cheesy bread becomes the highlight if the meal. It was just OK. The most inexperienced cook could make it at home with sourdough, butter, and three types of cheese. \n\nA few people in our party ordered the mushroom rice side dish and it was not good. After tasting it, I was grateful to have passed on this wet, mush. \n\nSERVICE: Our waitress was very attentive and responsive. She was more than willing to return the overcooked steaks. \n\nI won't be back, but I'm glad to have visited this historic spot.\n\nService: 4 stars\n\nKitch: 4 stars\n\nFood: 1 star", "date": "2013-06-24 06:42:29"}
{"review_id": "59ZTmdu9zHzXURZ2a9MiDQ", "user_id": "FDqFFZHUWcPvVu7XnQ8pug", "business_id": "f30-DOoIxvoV9btiDvKMTw", "stars": 4.0, "text": "Food is prepared fresh and flavored are great. Eaten three lunches and all were great. Service is a combined effort, so they on top of any needs.", "date": "2016-06-11 20:38:34"}
{"review_id": "q2vaJIvAbl-1fmephTAeiQ", "user_id": "I9SE8CX69Hbf54WI8zw81w", "business_id": "_DiGwfdiH913E4LURwb2qg", "stars": 4.0, "text": "I ate at New India Bazaar for dinner. I took it to go. I ordered samosa, pani puri chaat, and gobi. The samosas were very good and very big! The main dish, gobi was really great. As a vegetarian it seemed like I was eating chicken, but it was cauliflower dumplings. The gobi had a comfort food appeal. The pani puri chaat was weird. I've never had it before, so I don't have a comparison. The description sounded yummy, but it just wasn't. The total cost was about $14. I would recommend this restaurant. I noticed that they have a pastry case with desserts. I plan to come back to shop. They  have the best prices that I've seen on neem toothpastes.", "date": "2012-07-16 02:48:09"}
{"review_id": "BOzcsr9s5foYKUmMu1Pjqg", "user_id": "-TMDrC66dvClx5Z7Hdzrfw", "business_id": "XhUec_6-kgPy1_ZYUrzvPQ", "stars": 2.0, "text": "hi, went to anthonys last thurs. night with a party of seven. We were celebrating an anniversary , we all dressed up to the nines ! ! wanted to have a fun nite out ! \nthe food is good, very high end .  2 of us ordered the prime rib, 2 others ordered filet, 3 others steak, plus apps of sashimi, tator tots, mashed potatoes, \nspinach, lobster bisques for all, they do charge extra for everything... so watch out,\nwe sat outside it is a nice view..... now the bad part... our waiter, Fabio. I don't like to be disrespectful to our food servers here in Vegas cuz they do work hard, but Fabio is\nvery rude, rushed us during our ordering, did not want to explain the specials after my uncle asked a question, he said he did not know, did not bring our drinks until after our dinner was served by someone else, he was very rude when we asked for another martini and never brought it. he also did not bring water until we asked four times cuz we passed on the bubbles water, he also tried to take out plates before we were done ! the place was empty, three times he wanted to take my plate with food on it ...jeeeez..... Anthonys please he needs more training on how to treat customers :(", "date": "2015-04-25 22:15:10"}
{"review_id": "V93SYj2OLh5m9Cquzf-7kg", "user_id": "ZwVz20be-hOZnyAbevyMyQ", "business_id": "2c9Vptks_vowLgVUMnCgjw", "stars": 4.0, "text": "Came here while in town for a country concert.  What better way to start our day.  Everything was great.  The service was amazing from the time we walked in the door.  We were sat at a table and to our surprise there is a beer and whiskey tap at the table.  You pay by the ounce and there is a screen to show you what you've drank.  The food we had was great.  The whiskey burger was my favorite.  For you country fans this is a must when in Scottsdale!", "date": "2013-09-04 01:29:46"}
{"review_id": "awLl8GdM0H3MJImLXsqvlg", "user_id": "h27iTTIaDicevvaopobUdA", "business_id": "X5uxdU9GHoUAqo2wmbg3OQ", "stars": 4.0, "text": "Service was prompt and good. I ordered the roti canai which was excellent and also filling. The chicken curry for the roti wasn't thick, I think that's a good combination as a dip. I also ordered the lamb curry (I forgot the exact name.. Rendang?) the flavor was good but I didn't like the taste of the meat the chicken or beef version is probably better. The lamb meat I feel tastes like lamb sweat. At least that's what I imagined it to be. I only gave it 4 stars because I wasn't satisfied with the lamb meat and some of the items there were a bit pricey. Other than that it's excellent and I like their beverages that they have a grass jelly drink and Malaysian iced tea :). Will definitely come back again next time.", "date": "2015-08-06 21:53:58"}
{"review_id": "w9vhFm9z4xZ5MFer1inIeg", "user_id": "s1nVP4bsB-pJhi4Ynp0YqQ", "business_id": "Rwj49QLS4FhZUyD_FzFGFg", "stars": 1.0, "text": "The worst. Got there 45 minutes after the store was supposed to be open and they weren't ready.  Ordered a sandwich and the oven hadn't been turned on.  I asked how long and the employee said a few minutes. 8 minutes later oven still not preheated and I let her know I had to go.  She then pulls the sandwich out of the oven.  Cleary the sandwich would not have been prepared correctly.  I did not take sandwich and had to leave to get to an appointment. My  quick stop for a coffee and breakfast to go was over 15 minutes.  When I sent in a complaint to the head office the slow response was they couldn't give me a credit but would send over coupons for a couple of beverages.  That is ridiculous.  I wanted a refund on the sandwich I never took. I pass by this second cup 5 days a week. I'm going to keep on driving and stick with Starbucks. You should also steer clear. Best example of the worst service.", "date": "2018-07-26 09:35:55"}
{"review_id": "UPQ79Rqc27mKXYGAMRZ6qg", "user_id": "NqY4ku6Zqdalaozxk0NQ8w", "business_id": "w1clLiXOo-yLhNjt5jDBCA", "stars": 3.0, "text": "Their is a bit of a disconnect from the moment you arrive in the parking lot as the signage makes a cool, sophisticated impression that does not match the semi-bland interior. This could be any of the relatively higher chain restos that feels like it needs an update but maybe that's just me?\n\nThe food is the thing in any restaurant and pretty much everything was just ok. Our salesman/server;) confidently stated the steak tacos were the best menu item, and they were, but still only rated a just above average 3.5.\n\nI had a ribeye with mashed and seasonal vegetables that was not coked to medium as requested (who knows why they ask in spots like this because it is pretty much never done right?). The accompanying sauce was actually very good and that saved this dish for me.\n\nIf Union Social was located closer to where we live it might merit another chance but we live in the south end of Mississauga and thus will be sticking closer to home.", "date": "2014-11-30 00:36:29"}
{"review_id": "lQvS2q_DbmMYbieGy-qW4A", "user_id": "o5yDcEolR08ZhdhXjN1GTA", "business_id": "abaIvBrlg3QI4FUG1v3bdA", "stars": 4.0, "text": "Très grand café, mais aussi calme et reposant, je m'y suis arrêté alors que j'étais dans le coin.\n\nOn peu y mangé le midi, prendre une pâtisserie ou un café/thé. \n\nJ'ai prit un thé qui était vraiment bon, et je me suis posé devant une des grandes baies vitrées sur un coussin et j'ai relaxé complètement pendant 2 heures. \n\nMais c'est aussi une coopérative d'artiste, avec une estrade etc.\n\nIl y a aussi un magasin Bio à l'entrée où vous retrouverez des savons, huile d'olive et plein d'autres produits.", "date": "2013-10-03 12:28:32"}
{"review_id": "BFM_flUW3wHOuGOmJt3DnQ", "user_id": "8m9q7KT9Bgw6qMjHBMb4YA", "business_id": "_6mvQX9x66oz046eS5ii8w", "stars": 5.0, "text": "Chilaquiles is on point. I bought them last and saved them for breakfast today. The sauce and tortillas were SO good!", "date": "2017-09-20 14:49:17"}
{"review_id": "0Nfq1Yz9QdAVGHqmLrav8Q", "user_id": "b9Cfa7tkxrl8zuH7yEvEPg", "business_id": "S9-8BjiC0G_58fIeezypPQ", "stars": 1.0, "text": "I e-mailed head office months ago about a lousy experience at their Yonge & College Street location and never received a response. Was never a huge fan to begin with but that confirmed things for me. \n\nOh, and the Cobb salad doesn't have chicken in it anymore...what a rip off!", "date": "2014-01-17 02:58:23"}
{"review_id": "OP2WvjTM1vxVSmcvbsuyzg", "user_id": "rwnGmtQTXweXYwqqiEk0cg", "business_id": "qQCsLGMncJp1xWUGnOKCQA", "stars": 5.0, "text": "Much better coffee than the big chains.  This is a great place for a quick lunch or breakfast and the drive through makes caffeine fill ups easy.", "date": "2014-02-05 18:35:31"}
{"review_id": "XqFb2c5I4l8Q5SmQ30datA", "user_id": "MXwWj1pbG29aC3tFdyo7XA", "business_id": "R1jJQi2yR44D_2ileqr8kA", "stars": 5.0, "text": "My companion and I went to Living Kitchen on an impulse and am very happy to say it was delicious and worth it! My companion got the Arugula Harvest salad and I got the Pad Thai. The Arugula Harvest salad was very tasty and all of the components came together well. The Pad Thai was also very flavorful and had an awesome sauce which had a good afterburn to it. I would highly recommend coming here to try the food vegan, vegetarian, or otherwise.", "date": "2017-07-28 18:01:21"}
{"review_id": "-2j4m2ffQgPx93fszFN-yg", "user_id": "571FUKN0GeguuIAuQF0Xyg", "business_id": "GGLqPXkKLIH-VVIBzLje3Q", "stars": 1.0, "text": "This is the worst gym I've ever been to, and I've grown up in the gym business. These guys only care about your money and nothing more. When I joined I later had to cancel with them because I had to meet with my National Guard unit and I didn't know what kind of schedule I'd have. They seemed understanding and said it wasn't a problem. At this time I would have rated this gym very good, because I had fun with no issues. I even told them I'd probably start back up here after I know what schedule looked like. So I stop going after my month expired because I cancelled(even on my attendance sheet it said it was my last and only month.) I later check my bank statement and they charged me again, okay no big deal probably a mistake. I call them, no answer. Okay that's fine I'll email them explaining the mistake. I'll give them a few days to get back to me max. Hear nothing from them. Call them again, no answer. Call them again they finally answered. I explain the situation with guy that answers and he says \"Oh yeah i got your email but I forgot to call you.\". At this point I'm a little rubbed wrong with they're crap customer service. Then after that he tells me no I haven't cancelled and I'm going to have to pay another two months worth. He tells me I must have misunderstood him (he speaks broken English so he must have misunderstood me when I cancelled with him a month prior to this). He won't help me out at all, just says I have to pay more. Thank god I have Navy Federal for a bank because I call them after this and they let me know these guys shouldn't be changing me. They repay me for what the gym took and put a dispute on the gym, they also put a stop payment on the gym. Well sure and behold I get charged by them AGAIN and I call my bank asking why did this happen? Turns out this gym is manually putting my card information in to get past the stop payment. I ask what I can do. They say to email them so I have proof i contacted them in case they try to lie. So I email these dirt bags and guess what once again nothing but they email me the SCHEDULE FOR THE CLASSES. Once again my bank is helping me, thank goodness. Not veteran friendly.", "date": "2016-06-03 17:41:45"}
{"review_id": "8QXoOgBimlXyRl0ISMXfGg", "user_id": "_ucMEPl0IRvHpruqTXndiQ", "business_id": "XwJ6fZRVbxQYRsryy4-qDw", "stars": 4.0, "text": "Better than hot & juicy and boiling crab.. They would have gotten 5 starts from me, but they forgot my crab legs! The main reason I wanted to come here.. It was disappointing, but the flavors are really good and the seafood was very fresh.. I love that they use real butter in the sauce and not margarine like all the other crawfish spots!! So this will be my new seafood spot..", "date": "2016-07-25 06:13:46"}
{"review_id": "pCbyWYtW1kmrz-nV1irddA", "user_id": "E08iscTU73ioVEaU2_ZWCQ", "business_id": "pH0BLkL4cbxKzu471VZnuA", "stars": 5.0, "text": "A wonderful dinner experience! Hubby and I came couple months ago, it was our first time at Sushi Samba. We didn't have reservations, but they were able to seat us at the sushi bar. \nWe had the A5 Wagyu gyoza, was tender and not overdone, Tuna tataki, Chicken Samba was a good size portion, El topo roll, chef sashimi selections, and Tonkotsu ramen. Everything we order was super yummy!  Definitely coming back again next time we're in town!!\nI would recommend making reservations next time, the sushi bar is kind of tight and if you order a good amount of food, not too much room.", "date": "2017-09-08 23:17:03"}
{"review_id": "HJOHmSJONel2m6Qg9eyR7g", "user_id": "cyuDrrG5eEK-TZI867MUPA", "business_id": "at-X5UKYqBBXESk9MDFiaw", "stars": 4.0, "text": "Had the occasion over the last few weeks to experience their sports medicine/physical therapy department.  Outstanding.  Drs. Anthony \"Tony\" Walker and Jennifer Hannon are a great team.  They really know their stuff.\n\nBeyond knowing their stuff is their continual dialogue with patients.  On each appointment we began discussing how the exercises were working, how I was feeling, what is working or not.  Then we would get into planning for that day and going forward.\n\nI was involved in the therapy.  And we continued in this joint planning over a month of treatments.\n\nThey administer a tablet form of survey asking about your condition and how it is affecting your life.  After the therapy has run its course you complete the same survey, so they have a before and after record of your condition.\n\nImpressive and given the people cycling through this practice it was clear that the facility and all the therapists were doing something special.\n\nGood resource for most all of us.", "date": "2017-12-02 18:16:21"}
{"review_id": "CuyM0K0aKwmu63n_UZ5Ufw", "user_id": "MSiWfBVnFNFbHMHh0yMyVw", "business_id": "yxJcVTwvHjuVtOKA3FCyYA", "stars": 5.0, "text": "The food here is the best Greek food I've had in Arizona. The prices aren't too bad and the service was great. They are really fast too!!", "date": "2016-07-14 19:32:07"}
{"review_id": "sdQWECjMdRmQ2vNf6461Ug", "user_id": "Z1gjMENAUXVNefNnrKxdog", "business_id": "d_L-rfS1vT3JMzgCUGtiow", "stars": 2.0, "text": "I understand Las Vegas is over-priced.  But $50 for a pitcher of mediocre sangria - more than 1/2 way filled with ice - with not a slice of fruit in sight?  ANNOYING.  \n\nFriendly staff.  My food (fish tacos) was not nearly as good as the time I had it before.  \n\nIt is conveniently located very close to the convention center so it gets packed when events are going on.", "date": "2015-06-08 18:06:13"}
{"review_id": "7OZuvmg7aQvG8gJrYuraUA", "user_id": "h3Iydnd3iXDD_cAln6HhlQ", "business_id": "oj8qk3W7O9oq15VIs-vYJQ", "stars": 2.0, "text": "Looked forward to eating here for so long...too bad it was on my birthday - food was good but the service was deplorable so not going to rehash this too much (apologies to my man and bro as I know they were also hoping for better)\n\nThe appetizers were by far the best thing - the entree's were good with red meat being the star. \nPeach cobbler desert was all topping that I swear was merely microwaved and had one slice of grilled peach - putting a candle on it did nothing to make me think this was the birthday dessert I was for... \n\nI highly recommend the flight of 10, 20 30 & 40 yr old ports - this mellowed out the complete waste of skin that was our server. Not sure if he thought we looked unable to tip for a spendy bill or weren't as enthralled as the table next to us with his Montana stories but my brother aptly reconfirmed his tip expectation with 7% - too much in my opinion for not giving diddley about someone chosing their restaurant to celebrate in.", "date": "2011-08-24 22:56:36"}
{"review_id": "h0rm2tjfYz_TEZEmmE0Uvg", "user_id": "uiHXWOoDtIjTWXZOB-mjAA", "business_id": "0BW6h-igJinzbqc-prYUaQ", "stars": 4.0, "text": "Hy Steakhouse is a contemporary and elegant  traditional steak house, with lots of open space and an intimate dinning experience.\n\nWe started with the Famous Cheese Toast, oyster rockerfeller which was 6  sweet and savory but very small oysters.  And the beef tartare, which was made table side and served with small biscuits.\n\nWe ended off with the 22 oz. porterhouse steak, which was cooked perfectly to order and was more than enough for the both of us.\n\nOur server was friendly and insightful, and always catered to our needs at the table, other servers were also helpful but tended to their own tables. Although there were several mistakes on our bill initially, such as wrong food and drinks and extra items being billed, our server fixed everything easily.\n\nThe room itself was dimmed and the ambiance was more intimate.\n\nIn conclusion, the food quality is above standard, service and cleanliness is high, and the atmosphere is intimate. The food is more old fashioned, come here for a great steak done right at a slightly higher price range than the keg.", "date": "2016-12-04 02:11:43"}
{"review_id": "3jCD1kXmKIY-9ia-oReQhg", "user_id": "sezp3mgdB82MdBpQ2EumVg", "business_id": "cMK38jKxH8x5PvFfAfjZmA", "stars": 5.0, "text": "One of my favorite places to eat in town. They have the best bean dip I've ever had. The owner is so kind, and I highly recommend a margarita on the rocks and chicken tacos.", "date": "2015-08-19 05:42:19"}
{"review_id": "Tv87VbmTrCVlGukNUvdAsQ", "user_id": "kYddxyOJD_vELH6Vr_ytyw", "business_id": "yNVcnSaMSrTmjJBMrHTy9w", "stars": 4.0, "text": "Battista's Hole In the Wall is awesome! Went here for the first time when I was in Vegas for my kickball tourney (WAKApalooza) early October. My teammate is a huge fan and suggested this place to the rest of the team for a big team dinner Saturday night.\n\nIt's located right next to the Flamingo Hotel where we were staying, so we were able to walk over. The restaurant is pretty big itself, but the tables are sort of cramped together in small rooms. The decor is awesome. Definitely a friendly, local vibe. Since our party was pretty big (about 14 of us), we had to wait a bit before getting a table. Not a big deal, since we started pre-drinking at the bar. The price range for the meals depends, but all range from $23-40. You get unlimited red or white wine with your meal though, plus all the meals come with Minestrone soup or Italian salad, garlic bread, pasta side & homemade Cappuccino. I ordered the lasagna and it was huge. I probably ate a quarter of it before I got full. I probably wouldn't have been as full if I hadn't filled up on garlic bread, but I couldn't help it - the garlic bread was ah-mazing. The cappuccino was really good too! More of a hot chocolate than coffee to be honest.\n\nService was good. They were kind enough to split our party in two, to help make the check easier. We even had a gentleman come serenade us with his accordian! I would definitely come back again.", "date": "2013-11-14 02:38:47"}
{"review_id": "vT5D_AuhMImJFMf5DZoNzw", "user_id": "l-kZ9PMmqWS6doVxijUkhw", "business_id": "isw3cS3hOKdKeBgi3lF3-A", "stars": 5.0, "text": "The best aged angus burger fed on carrots..... the staff is awesome too.... can't wait to go back....", "date": "2018-02-11 02:35:40"}
{"review_id": "0y6G9k9mgwORZ0oK4hTEHg", "user_id": "1IhQLnq__TWCaMgDgoihJQ", "business_id": "M8a5DRdXl8KMu4bMFLPgQg", "stars": 5.0, "text": "I have been going to this nail salon for 8 months now.  I only go to Ahn - she is so great!  Never once has she hurt me while cutting my cuticles.  I always get gel manicure & pedicure & she does a fantastic job!!   All tools are clean & sterilized and salon is pleasant  to be in.", "date": "2018-03-15 20:27:02"}
{"review_id": "uoogIm15DCkUUjIdQjwmPA", "user_id": "NS9uz1e7_77ESixQJ_B4vg", "business_id": "dnBQZpWTyJzTe0QJf7YK5w", "stars": 3.0, "text": "Decent burgers here.  Didn't live up to the hype, though.\n\nOne thing that concerned me was the gal cooking the burgers had long hair that was not tied back.  Just an FYI in case you're squeamish about plucking hair out of your food.", "date": "2015-07-03 21:23:50"}
{"review_id": "kKYoJIofGkSmtuCDgq0Lmg", "user_id": "xv3zwYXc5QRXS1QtKyByLg", "business_id": "GHUHWAaVjKDn74r50EKKMA", "stars": 2.0, "text": "I should have listened at the other reviews for this place. I got the Hopeful Signature Poke Bowl and it was very bland, and didn't quite sit right in my stomach. Maybe too much sauce? It is comparable to  having salmon sushi ingredients in a bowl with way too much rice. It's too bad, because I love poke bowls and had high hopes for this place. 2 stars for the nice interior.", "date": "2016-11-09 20:14:58"}
{"review_id": "zBfqsDmGs8f4LYbwrTfljQ", "user_id": "TRYSfdtUnDgYXOlzKDt2Sw", "business_id": "6WdKJJbK6EC5R8PKGWMsng", "stars": 1.0, "text": "I was very disappointed with the customer service from the server to the owner which really surprised me, what a BITCH!  I ordered a western omelet with hash browns crispy and when I got the omelet there was no cheese in it. The hash browns were barely cooked. In addition, we wanted coffee refills and no one ever came back to ask us!!  When I inquired about the no cheese the server told me no it doesn't come with it, and when I asked the owner she said that that isn't the correct way western omelets traditionally  are served! She argued with me about the history of the western omelet instead she should have been more focused on her customers being happy, especially since we I told her it was our first time there and we were excited to try her food Quite honestly, I don't look for a class lesson when I go out to eat I just want good food and good customer service, I got neither today!  The correct thing for the server and the half wit owner would have been to say, \" sorry sir but I would be happy to redo your omelet with cheese and make u another order of hash browns and make sure they are crispy\".  But guess what none of that happened!  I have cooked in restaurant my whole life and I have never heard of any omelet not coming with some type of cheese and even if she was correct in her history, she definitely failed me at her customer service skills. In addition, when paying for my food I was told that they only take cash so I had to go out and get cash to pay for this horrible experience and that didn't sit well with me, I almost said screwed it, but my conscience said don't do it, so I went back and paid my bill.  Long story short, if you want good customer service and u want good food I would recommend going to Denny's or Bob Evans. Oh yeah one more thing, if no stars were a choice I would have put none!!!", "date": "2015-12-20 19:46:48"}
{"review_id": "EFxBedsePmXHyxUkokSt6g", "user_id": "2NPOUyIMPYofknvLBZjUzA", "business_id": "LUN6swQYa4xJKaM_UEUOEw", "stars": 5.0, "text": "WHOA!\n\nRed Carpet handles business.  No WAIT No LINES No HASSLE,  seriously though.  Why worry about lines in Vegas when you can pregame in the room and immediately step into the club?!?!  \n\nI'd give them a million stars.\n\nWalked into XS -no problem-       9 dudes\nWalked into EBC- no problem-    9 dudes\nCrazy huge 30 passenger limo- GMC Kodiak or something-   Ridiculous\n\nCouldn't have made my bachelor party better.  I will be using them again and again for as long as I live when I come to Vegas.  All their staff is great with email or phone correspondence, thank you Annie!!\n\nYou cannot go wrong with them.  Shell out the extra dough and book your Vegas clubbing experience, you wont be disappointed.", "date": "2012-08-15 00:02:04"}
{"review_id": "YXlVUZAU8mjj68k0OBmNqg", "user_id": "2mjK8WdW65lQpF9p7MYbOA", "business_id": "AMN3Sgns9tB2x-b3eWk0qQ", "stars": 5.0, "text": "This is one of my favorite places to eat.  The food is delicious, fresh and almost everything can be made with tofu as a substitute.  The owners are very friendly and the food truly is superb!", "date": "2010-07-07 20:32:25"}
{"review_id": "e2YdyDmFaps6frh6kWRABw", "user_id": "X61CbjwRDWWPRkN61PIpyA", "business_id": "ipFobdM6X_4SNMA9ZBfdAQ", "stars": 4.0, "text": "Pita jungle is one of our family's favorite places to go for a quick, fresh, healthy meal. The kids love the chipotle chicken flatbread and I am addicted to the Moroccan gazpacho! We feel great when we leave and usually try make better food choices for the rest of the day!", "date": "2013-10-24 02:49:09"}
{"review_id": "acxgMnCCxBwmKY5Z6BTnDA", "user_id": "rrk8D0uKOHmD6rR8UGTg2g", "business_id": "Ntx4DE2hYO8z8Kvuwvm_Xw", "stars": 4.0, "text": "Love this pub. The food is not great but if you stick to the pub grub faves. You should be fine. The best part about this place is the staff! All the girls that work here are amazing! :)", "date": "2012-04-28 12:44:34"}
{"review_id": "7hH7PDmPgveApl1kwLU5fg", "user_id": "fzw1wIiCkyP_N-uX49PRfA", "business_id": "xFSCaBlcnDXSGFPUtYtuXA", "stars": 1.0, "text": "I placed a large takeout order (almost $100) late on a Thursday night and the gentleman made me repeat every part of the order at least twice. He didn't even bother to tell me what time the order would be ready. I frequent this place for lunch and use them for work events pretty frequently and have always had a decent experience but not this time.\n\nWhen I got home and went to unpack the food, I realized the order was completely wrong. Checked the receipt and the order that was rung in was completely different then what I asked for and with totally different quantities. It was as if the order was erased and the guy just tried to make it up out of memory. Certainly was not please to have ordered mainly calzones and end up with almost all subs.\n\nThe most annoying part of the experience is the sausage, pepper and onion subs were 85% peppers and onions. There was about 10 slices of very very thin sausage on the entire sandwhich which I think is a ripoff for $8.99. Terrible experience overall and will highly make me reconsider ever going here again.", "date": "2017-01-15 00:11:59"}
{"review_id": "rbUqm4ZQF9HGqOLcVL5LpA", "user_id": "6bph3p-nAF_CtP7IIGC5aQ", "business_id": "ujPuhQdg8-GCJQg6BoRJtA", "stars": 5.0, "text": "Unfortunately, I don't understand the negative reviews, maybe it was bad timing? But I LOVED the crazy burger. I brought my American friend and he had the Green burger, and was impressed about how good it was. SUPER friendly staff, they made sure I had every condiment (ketchup, napkins etc.) I didn't expect any service at all from a burger joint but it was an pleasant addition. I'll be coming back for the food and the exceptional service. I've never had such a nice experience at a burger joint before. I'd recommend the Crazy Burger combo (Onion rings and Boylan's Black Cherry Soda). Although it was a bit messy it was delicious, and I loved every single bite of it. I'll definitely be coming back soon.", "date": "2014-04-01 02:30:32"}
{"review_id": "OED6UmN9WWtBrGCfpokffg", "user_id": "WJKocp9RE0KatUwh3_DkGg", "business_id": "yNPh5SO-7wr8HPpVCDPbXQ", "stars": 3.0, "text": "This is a tricky one. AB is a really cool looking spot, really nice decor and ambiance, comfy booths, it even smells like a new car.\n\nMy group was greeted promptly by smiling hosts, and seated in a nice booth. Drink orders were placed, and when our margaritas arrived, they were really, really off and tasted terrible. Even after stirring, and thinking positive thoughts- they just were off- not sweet enough, and didn't taste good. Our server was cool and he swapped them out for other stuff. My replacement drink was a Polish Fizz, and it was perfect. Highly recommended.\n\nFor an app we went with the pretzel fondue, thanks to Yelpers who recommended it. As advertised, it was delicious, and I recommend it. For lunch I had the fish and chips, and my friend had some salad. The fish and chips were very tasty, but the price point, for the portion I got- just didn't compute. Three pieces of fish (think chicken tender size) and a small portion of fries, along with a small side of overly vinegared cole slaw. Again, the food was good, but you definitely don't get what you pay for. I understand the concept of smaller portions, euro style, etc. but for a bar food staple? I wasn't looking for a Costco serving of anything, but either bump up portion size, or drop the price from $16 to $11.50.\n\nI really liked our server, but for some reason as things went on, he was more and more absent. To be fair, we had a really difficult person that joined us, some of the stuff this person said made me want to pull my hair out, so I feel his pain.\n\nAnyway, AB is a very attractive spot that might be great for drinks and app. but for this price point, I would hit Durant's, Hillstone, or Beckett's Table. It's nice to leave a spot feeling that you got your monies worth, and that just doesn't happen here.", "date": "2011-03-19 23:47:17"}
{"review_id": "fsXTNmi-cHlDQHzJ4GHg7w", "user_id": "7u8Cm8TlV4LDRXDqHBVAPg", "business_id": "3KzzG6dw5aN9eIo3cGHaSA", "stars": 1.0, "text": "Wish I could give this place 0 stars. We have had issues here before with being seated (it took them 15 minutes when the place was empty one time), but tonight takes the cake. \n     We went to get food at 2am, pulled into the drive thru at 2:32. We waited there for 15 minutes, then we got trapped in the drive thru by a curb and other vehicles for 25 more minutes. I got incredibly fed up and walked inside. There were 2 tables seated - and they were already eating. One woman was ordering at the counter when I went in. \n     I asked the worker at the counter if they shut down the drive thru and if they could inform the people waiting at the speaker because we were stuck and just wanted to leave. All he said is \"I don't know if they shut down the drive thru but I can take your order here.\" Like THAT DOESNT HELP US. We are STILL stuck in your crappy little drive thru and we don't even want to order here anymore. He said he would meet me outside - which he DIDNT by the way, but the line started to move so we said whatever and decided to still order because we had already waited 40 minutes.\n     After they got the person in front of us through the drive thru, they then told US to hold on a minutes because they are \"backed up inside\", but they weren't at all. The parking lot had 2 cars and 3 people behind us in line, and when I was inside, a server was sitting at a table texting. So don't tell me you are busy if your staff is getting paid for nothing. I yelled \"are you getting paid for this?\" Through the speaker and he had time to answer and tell me to CALM DOWN but couldn't take my damn order.\n     We finally left with out even PLACING an order after 49 minutes. Will not return and by the other reviews for this place, I should have checked yelp before ever coming here in the first place. Went to the Mentor one after and got served right away.", "date": "2017-05-13 07:49:35"}
{"review_id": "2F0a90CQtFhplfKmdP1Cnw", "user_id": "IZKX8BHHjS8YwHIVi9KJ2g", "business_id": "YDZRlB762hEebm2OyZISiQ", "stars": 3.0, "text": "Not the best pizza, but not the worst, and it's only $7. I've only had the pepperoni, but they have plenty of variety. The guy behind the counter was super friendly. Remember- cash only!", "date": "2011-01-08 22:09:38"}
{"review_id": "O_w2fnNmG-zJcbN8ft5DAw", "user_id": "HFFiM63x9asevqVOZG5GBQ", "business_id": "d8lmIZIqmBC9oPM8y1dc7Q", "stars": 5.0, "text": "Paco's Tacos is the real deal! In spite of the great Yelp reviews, I still had my reservations about eating at another TexMex chain. How good could it be I thought? Well they totally nailed it, from the complementary chips and dip to the sauce stains on my napkin!\n\nThe dining area was empty and only a few people were at the bar upon my arrival for a late lunch. Adlai our server was very helpful with recommendations and was knowledgeable of the menu. I had a overstuffed grilled chicken taco which arrived with Mexican rice, mixed cabbage coleslaw and, their own, Charro style pintos, all at the incredible price of... drum roll please... 7 Bucks! My buddy tried Paco's Taco which is shredded beef and was equally as tasty. Servings are huge and everything was fantastic. \n\nPremeal chips and salsa were delivered to the table immediately. The chips are very thin and were very fresh. The place was clean and attractive. Sanitation rating was a 95. For those long time Charlotteans like myself, you may remember this place as the old Manzetti's.\n\nI'm going back soon! This place is a Gotta Try!.", "date": "2016-11-09 19:59:58"}
{"review_id": "CmZzpN0GRvmuiQCN0YtBbQ", "user_id": "HNrz6Xe7PoLjUp8kBUDykQ", "business_id": "ViJGzET7fBMShhIgKew2Bg", "stars": 4.0, "text": "Out shopping (gross), I got a hankering for Mexican food, and Border MX was the best rated option that came up.\n\nOverall, food was pretty good (chimichanga al pastor, flag enchilladas, and guacamole and chips) - though it was really slow coming out (despite not being busy), and the enchiladas were not as hot as my missus expected they would be. That said, drinks (including really good micheladas) were good, the guac was excellent, and overall, we left pretty happy (they Yelp special churros were a nice touch) - not an area I'm in a lot, but definitely impressed me with the authenticity - it was just the lag and the temperature of the food that was a little off.", "date": "2017-11-06 16:29:55"}
{"review_id": "Qja_UmpngoG6tlbUkq5ulg", "user_id": "c_gty-iBAbezPUCSV9qXAQ", "business_id": "bY8K4r_RGOm_1cspCOKdPQ", "stars": 5.0, "text": "Lovely food. I am also happy to eat at this location of paradise bakery.. they have fresh ingredients and make good alterations if asked for. Great for vegetarians and well as non vegetarians.\nFact that this location is in tempe marketplace, makes a high difference so we can enjoy outdoor seating in evenings.", "date": "2012-08-15 00:25:08"}
{"review_id": "gt9gXmj5C3aVeButf2OH5w", "user_id": "TQSLNRAtiXj1zyLZ3OAVrw", "business_id": "-oOKqZbYDt08zaWWyLZNIw", "stars": 4.0, "text": "The food is great and the prices are reasonable. They give you a nice amount of food for what you pay for.", "date": "2018-04-04 02:25:52"}
{"review_id": "6ANp9mICQhti6LzssKGrGA", "user_id": "Y9RDx7m0YzByTtD3ZGS1MA", "business_id": "I4EmpNOW7zCcx7fUnQ9ixg", "stars": 5.0, "text": "This is my new favorite restaurant in Surprise, which isn't very hard to do because surprise is full of nasty chain restaurants. However, if you want to eat some darn good vietnamese food, this is the place. The pho of any type is amazing, even to go. Also try the spring rolls. Make sure you wrap them in the lettuce with a bit of mint, the texture is bomb fool! It gets a little crowded around 6pm because all of Sun City eats dinner around that time. So show up around 7pm and you'll be fine.", "date": "2012-06-26 05:15:48"}
{"review_id": "q2gNL2WmIypxUrf34VCi5w", "user_id": "8NwU4TRsD3S6gIfBqFzDMQ", "business_id": "6xgcHeLad-VaoTIQewK84A", "stars": 5.0, "text": "Great steak. Great service. Cool venue. Although it's died down a bit, this place is still always on my radar for good food.", "date": "2012-11-06 03:42:56"}
{"review_id": "qYvgd4HcPCSCiNVmeaclaw", "user_id": "h9y55WNNg7SYg3kQwzTMmQ", "business_id": "c35qzLN6ItDpVIoj2uQW4Q", "stars": 5.0, "text": "Had the soup and sandwich.  Wow, it was great.  I can't wait to return.", "date": "2014-02-23 22:52:13"}
{"review_id": "8uc8dxJn1m-aeCSvcvnnmw", "user_id": "gi0Y_kIFI3F_9XW6bUjrSQ", "business_id": "rvnTFEq7R2ZHg0_CYbBNFw", "stars": 5.0, "text": "OK, this buffet is pricey.  Something in the neighborhood of $48 i think, but if you go to the Tix4Tonight or similar vendors you can buy a voucher for $2 that gets you into the buffet for $33 and change, so a total of $35... a $10 savings. A bottle of OK wine is 12 bucks and this becomes a really fun evening. Some complain that the food isn't prepared like some 5 star restaurant, but guess what... This isn't a 5 star restaurant... it's a decent buffet where you can try a little or a lot of everything. It's just fun, and a lot cheaper than those fancy chef name places in the hotels. Oysters,  crab, all kinds of fish and shellfish and lobsters. They have all of this and lots of veges and other dishes. I really like the dessert selection but admittedly,  when I am full of wine, crab, scallops and oysters the deserts start looking less attractive. Food critics, say what you like... the restaurant that fills up nightly for years and years is doing something that real people like! Don't forget to hit the half price ticket place for your discount vouchers before you go!", "date": "2015-10-23 13:02:48"}
{"review_id": "iNpk4PDjS6AmpMoyeFmcuA", "user_id": "dUDVjHyvmmMgTyRgc-vstw", "business_id": "MsZ0jE2_iSDY8eOqNCSR1A", "stars": 1.0, "text": "Don't go here. Especially not for a full hour table massage. I've never tried the chair massages so I can't speak to those, but the table massage was not a great experience. I'll spare the details, but I definitely don't recommend this place.", "date": "2018-06-08 22:25:48"}
{"review_id": "1kSCzKEoNmhWIX5FP5XsEA", "user_id": "ETWISuSphgjc3puFAplnJg", "business_id": "5GwFUNl6nsDsMuv435G1Eg", "stars": 5.0, "text": "I was in Mesa for the morning and found this gem. I was greeted with a big smile and friendly service. The almond latte was really good, like REALLY good! If I lived in Mesa, I'd be a regular for the friendliness, good coffee, and really nice environment. It was busy, but nice and quiet - a feature that seems a bit rare in my experience. If I need coffee in Mesa again, this will be my go to place.", "date": "2017-01-14 21:51:16"}
{"review_id": "CsZu4mX7zrVw5kfM6Ca9wQ", "user_id": "XB-J13-Cd8JK65DLH-664g", "business_id": "WWWufR135GEXKynwYjLdGg", "stars": 4.0, "text": "I recently visited Pieology for the first time with friends recently and was really pleased with the selection and taste of the pies. For a set price you can pick your crust, base sauce and toppings, regardless of the amount and variety. The pizzas are made to order and placed in the oven for maybe 5-10 minutes.  There are gluten-free options as well for those that need.  \n\nOverall I'd have to say I'm a fan of Pieology now and will return in the future.  Staff is friendly and efficient. It was a relatively quiet late afternoon so the wait was negligible.  Check it out.", "date": "2017-09-09 01:13:40"}
{"review_id": "slWKNylDacmBn7Dq5pbZcQ", "user_id": "TFD3D5HwtF_cHicc9bk1tA", "business_id": "sT6KKMATRTiNSJ896D7l2w", "stars": 1.0, "text": "Please do not eat at this place, I'm scared of this food. The worst part is the service and the trashy, anti-family, anti-american atmosphere. Please stay away", "date": "2017-06-27 23:32:25"}
{"review_id": "G_4LjxpwN1FAmR0056Ux1w", "user_id": "tcFmCEOQj8BqZ4VZheKCrw", "business_id": "m3DVIvPsuLuA9OMSgWNLcQ", "stars": 4.0, "text": "Delicious oatmeal raisin cookie. Cute little spot and decor. Nice little place to sit and chat over coffee or lunch.", "date": "2017-01-27 19:14:38"}
{"review_id": "j1fyEVmCMtImN3xXZbXnHw", "user_id": "HHAb1Wp2jYvdnz-lslgaQw", "business_id": "k-drEjxKmfqllwfY90STfA", "stars": 5.0, "text": "Holy \"Made fresh at your table\" Guacamole!!!  My heart skips a beat just thinking about it.  Tex-Mex fine dining... at it's finest.\nAlso an important note:  One of my top five places to drink a house margarita.", "date": "2010-05-14 15:00:46"}
{"review_id": "GAlLd8Yqm2bGeNiU2JbVNQ", "user_id": "d8aeFi5aPsoW3UqWkbNmmw", "business_id": "5nyKUHibR4GCs6ojVljFdA", "stars": 1.0, "text": "Very disappointing, the price is too expensive for the food quality.   First of all, there is no green tea or red bean  ice cream on the menu.   They only have ice cream bar, and it is only one per person, on the menu, they didn't say that is limited. Secondly, way too much rice on the sushi. I guess thats how they make the money. Lastly, the ipad service is stupid. you have to wait for someone to confirm it. Overall, not a good reataurant for sushi.", "date": "2018-06-08 22:47:39"}
{"review_id": "AhVJhCrAcfQUiWmcZue4bQ", "user_id": "57JEtL3T7fw7Epqf6nHHiA", "business_id": "O6-BlCviQBIEcGW4ll6ZsQ", "stars": 5.0, "text": "So idk why ppl are giving this place such a hard time. I'm reviewing for EDC weekend. We checked in Thursday (the 20th). The guy up front gave me great service. \nIf you're looking for a place just to crash it's not bad. Nice location. Mid strip. Kinda hidden though. It was a bit hard to get ppl to find us haha.\nDon't expect a hot tub or something fancy. Like I said, just a place to crash.", "date": "2013-06-24 07:30:36"}
{"review_id": "4CMCRoNZgmxwtOBLG4I70g", "user_id": "5BfyObsvVjB6zcj8Wy5RDQ", "business_id": "hcFSc0OHgZJybnjQBrL_8Q", "stars": 5.0, "text": "Fresher noodles you may not find in this town, I tried the steamed vegetable dumplings and the chicken noodle soup - loved it! But careful the portions are big but the staff box it nicely and it still that's great next day :)\nAlso the mango bubble tea was tasty.", "date": "2014-02-05 18:10:23"}
{"review_id": "enWWjMnllD4m2WTV9plfJw", "user_id": "BvTOBGvOkrU-bwBI36Ep7w", "business_id": "ALwAlxItASeEs2vYAeLXHA", "stars": 5.0, "text": "Excellent ramen and one of the best restaurants in Charlotte. Very small area and limited seating, so arrive early or be ready to wait. Recommend all the bowls, sake flights, and be sure to get green tea ice cream.", "date": "2018-02-23 23:37:37"}
{"review_id": "CyEJDRmshSnV5hggsL8PSw", "user_id": "aNOSjqQFsrfcgmFtOv3lAA", "business_id": "Er2XAYN8l1BadlYFwiPb9g", "stars": 4.0, "text": "Had an awesome breakfast cum brunch. \nStaff is very warm and courteous and delicious food", "date": "2017-07-18 18:38:33"}
{"review_id": "DFf_1mpfLjTG6Zekmx6ZRg", "user_id": "BxCgM2bsV0AUvOpT42_klA", "business_id": "cDoo0Pf1d_P79Rq3ZNk-Mw", "stars": 5.0, "text": "Fresh and quality sashimi and great lunch time prices.  I tried it for lunch once and I am a fan, there are few quality Japanese restaurants in the city but this is amazing (even though it's Korean owned) and great value for the money.  Great decor and swift service.", "date": "2012-07-16 02:19:30"}
{"review_id": "3nNGcSLmeg9HuHmEutjY8w", "user_id": "wc1JiMpWL_9G9_XY7IHD5A", "business_id": "OvCQ-2YUSCT9X2uE52S-Nw", "stars": 5.0, "text": "Great ambience and decor! And the food is delicious. Pan fried fish, street side Indian noodles, hongkong chicken are a few names to start with !", "date": "2018-02-23 23:09:36"}
{"review_id": "wNKVnmK-8_MxzwykEZPT2g", "user_id": "d_Dwo3Itzi-gYg48f6jAPw", "business_id": "lywduRzRWrZLD03L2ZINhQ", "stars": 1.0, "text": "I don't normally like to do this, but I have to after the terrible experience I just had. Centurylink has the WORST customer service I've ever experienced. Two weeks ago I put in my order and the tech was scheduled to come in yesterday. Nobody showed up and nobody called to reschedule. Today I called, was on the phone for almost two hours, transferred to four people and was told they had to reschedule for Thursday, there was nothing they could do to help me earlier. I even talked to a supervisor who was the worst \"supervisor\" I've ever dealt with. Two hours later and I now have to wait until Thursday. Nobody apologized, nobody seemed to care. I told them if they don't come Thursday I'll be cancelling my service and going with Cox. Also, this whole time I was on their site talking with a live customer service rep online trying to figure this out, but all they told me was they couldn't do anything. So today's Worst Company Award goes to Centurylink.", "date": "2017-07-18 17:47:09"}
{"review_id": "NRUHiXvHs1x-mFAOetG17Q", "user_id": "nCqOSH2I6-k93B04FwouIA", "business_id": "udet1D1MNcKsR6n7fBpAyg", "stars": 3.0, "text": "Good prices here, huge pancakes available.  The place is a bit \"breakfast diner\"ish, which is fine since it is a breakfast diner.  My only probelm is that our server seemed a little impatient.  The service was fine, but could use a little more friendliness.  \n\nAnyways, this place is nothing special.  But if you're in the area, try it out and you'll get exactly what you expect when you're walking in.  No big surprises here. \n\nDerek", "date": "2010-11-22 02:34:59"}
{"review_id": "qlXw1JQ0UodW7qrmVgwCXw", "user_id": "bAhqAPoWaZYcyYi7bs024Q", "business_id": "LUN6swQYa4xJKaM_UEUOEw", "stars": 4.0, "text": "Michael from Red Carpet VIP is amazing ! I reached out because I needed help planning my soon to be sister in law's bachelorette. It was a group of 10 girls so I was a little overwhelmed but Michael saved the day! Everything was super smooth and easy! We got good deals and had the best time ever! We booked hotel and a bachelorette package for a great price. I have saved contact info because I will for sure reach out again on next Vegas trip!!!", "date": "2018-04-27 20:25:26"}
{"review_id": "qlXw1JQ0UodW7qrmVgwCXw", "user_id": "bAhqAPoWaZYcyYi7bs024Q", "business_id": "LUN6swQYa4xJKaM_UEUOEw", "stars": 4.0, "text": "Michael from Red Carpet VIP is amazing ! I reached out because I needed help planning my soon to be sister in law's bachelorette. It was a group of 10 girls so I was a little overwhelmed but Michael saved the day! Everything was super smooth and easy! We got good deals and had the best time ever! We booked hotel and a bachelorette package for a great price. I have saved contact info because I will for sure reach out again on next Vegas trip!!!", "date": "2018-04-27 20:25:26"}
{"review_id": "qlXw1JQ0UodW7qrmVgwCXw", "user_id": "bAhqAPoWaZYcyYi7bs024Q", "business_id": "LUN6swQYa4xJKaM_UEUOEw", "stars": 4.0, "text": "Michael from Red Carpet VIP is amazing ! I reached out because I needed help planning my soon to be sister in law's bachelorette. It was a group of 10 girls so I was a little overwhelmed but Michael saved the day! Everything was super smooth and easy! We got good deals and had the best time ever! We booked hotel and a bachelorette package for a great price. I have saved contact info because I will for sure reach out again on next Vegas trip!!!", "date": "2018-04-27 20:25:26"}
{"review_id": "BUgmey6v6hZ1WfjbIhpVBg", "user_id": "WS95iyoiDkbLGeHtERa1-A", "business_id": "1SWheh84yJXfytovILXOAQ", "stars": 1.0, "text": "Don't go here if you expect consistent or reasonable hours for the driving range.  It's clear the goal for the owners of this course is to hammer down their expenses without any concern for the customer.", "date": "2015-09-24 00:02:23"}
{"review_id": "BUgmey6v6hZ1WfjbIhpVBg", "user_id": "WS95iyoiDkbLGeHtERa1-A", "business_id": "1SWheh84yJXfytovILXOAQ", "stars": 1.0, "text": "Don't go here if you expect consistent or reasonable hours for the driving range.  It's clear the goal for the owners of this course is to hammer down their expenses without any concern for the customer.", "date": "2015-09-24 00:02:23"}
{"review_id": "-I5umRTkhw15RqpKMl_o1Q", "user_id": "-mA3-1mN4JIEkqOtdbNXCQ", "business_id": "mRUVMJkUGxrByzMQ2MuOpA", "stars": 1.0, "text": "Walked in around 4 on a Friday afternoon, we sat at a table just off the bar and walked out after 5 min or so. Don't even think they realized we walked in. However everyone at the bar noticed we walked in!!! Service was non existent at best. Not a good way for a new business to start out. Oh well, the location they are at has been about 5 different things over the past several years, so they will just be added to the list. SMDH!!!", "date": "2017-12-15 23:27:08"}
{"review_id": "-I5umRTkhw15RqpKMl_o1Q", "user_id": "-mA3-1mN4JIEkqOtdbNXCQ", "business_id": "mRUVMJkUGxrByzMQ2MuOpA", "stars": 1.0, "text": "Walked in around 4 on a Friday afternoon, we sat at a table just off the bar and walked out after 5 min or so. Don't even think they realized we walked in. However everyone at the bar noticed we walked in!!! Service was non existent at best. Not a good way for a new business to start out. Oh well, the location they are at has been about 5 different things over the past several years, so they will just be added to the list. SMDH!!!", "date": "2017-12-15 23:27:08"}